# 3. Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов 
# исходной последовательности.

# Глупо не использовать возможности языка, если они есть.
# В программировании я не новичок.

# И потом, задание выполнено согласно ТЗ

source_list = [1,2,2,4,5,5,7,9]
res_list = set(source_list)
print(res_list)